Revit 2027 API
MEPNetworkSegmentId Properties
The MEPNetworkSegmentId type exposes the following members.
Properties
Name | Description
ElementId |  The element id where this analytical segment belongs.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
SegmentId |  The segment identifier.
Top
See Also
Reference
MEPNetworkSegmentId Class
Autodesk.Revit.DB.Analysis Namespace